<html lang="en"><head><meta charset="utf-8"><title>Gjenoppretting &ndash; Apple Silicon</title><link rel="stylesheet" type="text/css" href="../css/static.css"></head><body class="apd-topic" dir="ltr" data-isTaskOpen="true"><header role="presentation" id="mchl82829c17" class="AppleTopic"><figure class="topicIcon"><img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"></figure><h1>Bruk macOS-gjenoppretting p&aring; en Mac med Apple Silicon</h1><p>macOS-gjenoppretting er det innebygde gjenopprettingssystemet p&aring; Macen.</p><p>Du kan bruke programmene i macOS-gjenoppretting p&aring; en Mac med Apple Silicon til &aring; reparere den interne disken, installere macOS p&aring; nytt, gjenopprette filene dine fra en Time Machine-sikkerhetskopi, angi sikkerhetsregler for forskjellige disker, overf&oslash;re filer mellom to Mac-datamaskiner, ta en sikker oppstart og mer.</p><p>For &aring; kunne installere macOS p&aring; nytt kreves det at du er tilkoblet internett. Du kan bruke et tr&aring;dl&oslash;st eller kablet nettverk til &aring; koble til internett. Se <a href="#mchle9d1cb3c" class="xRef Task">Koble til internett over Wi-Fi</a>.</p><div class="Alert"><p class="Note"><em>Merk: </em>Hvis du pr&oslash;ver &aring; koble til en p&aring;loggingsportal (for eksempel p&aring; en kaffebar, et bibliotek eller et hotell) eller et bedriftsnettverk, kan det hende at du ikke f&aring;r tilgang til internett i macOS-gjenoppretting.</p></div><div id="mchla906a106" class="Subhead"><div class="heading-nobreak"><h2 class="Name">Tilgjengelige programmer i macOS-gjenoppretting p&aring; en Mac med Apple Silicon</h2><p>F&oslash;lgende programmer er tilgjengelige i macOS-gjenoppretting p&aring; en Mac med Apple Silicon:</p></div><ul><li><p><em>Gjenoppretting: </em>Gjenoppretting-programmet gir tilgang til ytterligere programmer i macOS-gjenoppretting. Se <a href="#mchl5abfbb29" class="xRef Task">Start datamaskinen i macOS-gjenoppretting</a>, <a href="#mchldc3556ed" class="xRef Task">Start datamaskinen i macOS-gjenoppretting og sammenkoble den med Bluetooth-inndataenheter</a> og <a href="#mchlb7e93c86" class="xRef Task">Avslutt macOS-gjenoppretting</a>.</p></li><li><p><em>Time Machine-systemgjenoppretting: </em>Gjenopprett data fra en Time Machine-sikkerhetskopi. Velg Gjenopprett fra Time Machine i Gjenoppretting-programmet, og klikk deretter p&aring; Fortsett. Hvis du vil g&aring; tilbake til Gjenoppretting-programmet, velger du Time Machine-systemgjenoppretting &gt; Avslutt Time Machine-systemgjenoppretting. Se <a href="#mchlf4cdcc0f" class="xRef Task">Bruk Time Machine til &aring; gjenopprette systemet</a>.</p></li><li><p><em>Installer macOS: </em>Installer macOS p&aring; nytt p&aring; datamaskinen. Velg Installer macOS p&aring; nytt i Gjenoppretting-programmet, og klikk deretter p&aring; Fortsett. Velg Installer macOS Big Sur &gt; Avslutt Installer macOS Big Sur hvis du vil g&aring; tilbake til Gjenoppretting-programmet. Se <a href="#mchl57249f89" class="xRef Task">Installer macOS p&aring; nytt</a>.</p></li><li><p><em>Safari: </em>Velg Safari i Gjenoppretting-programmet, og klikk deretter p&aring; Fortsett. Velg Safari &gt; Avslutt Safari for &aring; g&aring; tilbake til Gjenoppretting-programmet. Hvis du er tilkoblet internett, kan du bruke Safari til &aring; s&oslash;ke etter mer informasjon p&aring; nettstedet for Apple-kundest&oslash;tte. Merk at programtillegg og utvidelser for Safari-nettleseren er deaktivert i macOS-gjenoppretting.</p></li><li><p><em>Diskverkt&oslash;y: </em>Reparer eller slett disken. Velg Diskverkt&oslash;y i Gjenoppretting-programmet, og klikk deretter p&aring; Fortsett. Velg Diskverkt&oslash;y &gt; Avslutt Diskverkt&oslash;y for &aring; g&aring; tilbake til Gjenoppretting-programmet. Se <a href="#mchl0e4c30d6" class="xRef Task">Slett macOS og installer det p&aring; nytt</a> og <a href="#mchl3fe49482" class="xRef Task">Reparer den interne lagringsdisken</a>.</p></li><li><p><em>Oppstartssikkerhetsverkt&oslash;y: </em>Angi sikkerhetsretningslinjer for Macen. Velg Verkt&oslash;y &gt; Oppstartssikkerhetsverkt&oslash;y i Gjenoppretting-programmet. Velg Oppstartssikkerhetsverkt&oslash;y &gt; Avslutt Oppstartssikkerhetsverkt&oslash;y for &aring; g&aring; tilbake til Gjenoppretting-programmet. Se <a href="#mchl9b13cbdc" class="xRef Task">Angi sikkerhetsretningslinjer</a>.</p></li><li><p><em>Terminal: </em>Endre innstillinger via kommandolinjen. Velg Verkt&oslash;y &gt; Terminal i Gjenoppretting-programmet. Velg Terminal &gt; Avslutt Terminal for &aring; g&aring; tilbake til Gjenoppretting-programmet.</p></li><li><p><em>Del disk: </em>Del disken p&aring; en Mac som er startet i macOS-gjenoppretting. Velg Verkt&oslash;y &gt; Del disk i Gjenoppretting-programmet. Se <a href="#mchl6e3b9225" class="xRef Task">Bruk Del disk til &aring; overf&oslash;re filer mellom to Mac-datamaskiner</a>.</p></li><li><p><em>Startdisk: </em>Angi startdisk for Macen. Velg Apple-menyen <img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"> &gt; Startdisk. Hvis du vil lukke programmet, velger du Startdisk &gt; Avslutt Startdisk.</p></li></ul></div><p>Du kan ogs&aring; bruke macOS-gjenoppretting til &aring; utf&oslash;re f&oslash;lgende handlinger:</p><ul><li><p><a href="#mchl08ae9930" class="xRef Task">Start datamaskinen i sikker modus</a></p></li><li><p><a href="#mchlbcf8b54b" class="xRef Task">Angi standard startvolum og start datamaskinen p&aring; nytt</a></p></li><li><p><a href="#mchl2a21e30c" class="xRef Task">Vis Gjenoppretting-loggen</a></p></li><li><p><a href="#mchl4ee3f192" class="xRef Task">Opprett en diagnostikkfil for gjenopprettingen</a></p></li></ul><div id="mchl5abfbb29" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl5abfbb29"><div class="heading-nobreak"><h2 aria-controls="aria-mchl5abfbb29" class="Name">Start datamaskinen i macOS-gjenoppretting</h2><ol><li><p>Velg Apple-menyen <img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"> &gt; Sl&aring; av.</p></li><li><p>Hold inne av/p&aring;-knappen p&aring; Macen til du ser «Laster inn startvalg».</p></li><li><p>Klikk p&aring; Valg, og klikk deretter p&aring; Fortsett.</p></li><li><p>Skriv inn passordet for en administratorkonto.</p></li></ol></div></div></div><div id="mchldc3556ed" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchldc3556ed"><div class="heading-nobreak"><h2 aria-controls="aria-mchldc3556ed" class="Name">Start datamaskinen i macOS-gjenoppretting og sammenkoble den med Bluetooth-inndataenheter</h2><p>F&oslash;lg disse instruksjonene hvis du trenger &aring; sammenkoble et Bluetooth-tastatur, en Bluetooth-styreflate eller en Bluetooth-mus med Macen n&aring;r du starter maskinen i macOS-gjenoppretting.</p></div><ol><li><p>Velg Apple-menyen <img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"> &gt; Sl&aring; av.</p></li><li><p>Hold inne av/p&aring;-knappen p&aring; Macen til du ser «Laster inn startvalg».</p></li><li><p>Trykk p&aring; av/p&aring;-knappen tre ganger n&aring;r systemvolumet og Valg-knappen vises.</p><div class="Alert"><p class="Note"><em>Merk: </em>Ikke la det g&aring; mer enn ett sekund mellom hvert trykk p&aring; av/p&aring;-knappen. Hvis du trykker p&aring; av/p&aring;-knappen for raskt, vil det ikke registreres, for raske trykk er reservert til andre bruksform&aring;l, blant annet VoiceOver.</p></div></li><li><p>Bruk Bluetooth-oppsettassistent til &aring; sammenkoble Bluetooth-tilbeh&oslash;r med Macen.</p><div class="Alert"><p class="Note"><em>Merk: </em>Bluetooth-oppsettassistent vises ikke hvis du allerede har koblet til en inndataenhet.</p></div></li><li><p>Skriv inn passordet for en administratorkonto.</p></li></ol></div></div><div id="mchl08ae9930" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl08ae9930"><div class="heading-nobreak"><h2 aria-controls="aria-mchl08ae9930" class="Name">Start datamaskinen i sikker modus</h2><ol><li><p>Velg Apple-menyen <img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"> &gt; Sl&aring; av.</p></li><li><p>Hold inne av/p&aring;-knappen p&aring; Macen til du ser «Laster inn startvalg».</p></li><li><p>Marker et volum.</p></li><li><p>Hold nede Skift-tasten og klikk deretter p&aring; Fortsett i sikker modus.</p><p>Datamaskinen starter p&aring; nytt automatisk.</p></li></ol></div></div></div><div id="mchlbcf8b54b" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchlbcf8b54b"><div class="heading-nobreak"><h2 aria-controls="aria-mchlbcf8b54b" class="Name">Angi standard startvolum og start datamaskinen p&aring; nytt</h2><ol><li><p>Velg Apple-menyen <img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"> &gt; Sl&aring; av.</p></li><li><p>Hold inne av/p&aring;-knappen p&aring; Macen til du ser «Laster inn startvalg».</p></li><li><p>Marker et volum.</p></li><li><p>Hold nede Skift-tasten, og klikk deretter p&aring; Bruk alltid.</p><p>Datamaskinen starter p&aring; nytt automatisk.</p></li></ol></div></div></div><div id="mchle9d1cb3c" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchle9d1cb3c"><div class="heading-nobreak"><h2 aria-controls="aria-mchle9d1cb3c" class="Name">Koble til internett over Wi-Fi</h2><p>Hvis symbolet for Wi-Fi-menyen (oppe i h&oslash;yre hj&oslash;rne p&aring; skjermen) viser en eller flere streker <span class="NoBreak"><img src="../SharedGlobalArt/IL_Wifi.png" alt="" height="30" width="42">, </span>er Wi-Fi sl&aring;tt p&aring; og tilkoblet et tr&aring;dl&oslash;st nettverk. Hvis symbolet for Wi-Fi-menyen ikke viser noen streker <span class="NoBreak"><img src="../SharedGlobalArt/IL_WiFiNoBars.png" alt="" height="30" width="41">, </span>er Wi-Fi sl&aring;tt p&aring;, men ikke tilkoblet et tr&aring;dl&oslash;st nettverk. Hvis det g&aring;r en skr&aring;strek gjennom symbolet for Wi-Fi-menyen <span class="NoBreak"><img src="../SharedGlobalArt/IL_WifiSlash.png" alt="" height="30" width="34">, </span>er Wi-Fi sl&aring;tt av. Wi-Fi m&aring; sl&aring;s p&aring; f&oslash;r du kan koble til et tr&aring;dl&oslash;st nettverk.</p></div><p>Gj&oslash;r f&oslash;lgende p&aring; Macen:</p><ul><li><p><em>Sl&aring; p&aring; Wi-Fi: </em>Klikk p&aring; symbolet for Wi-Fi-menyen, og velg deretter Sl&aring; p&aring; Wi-Fi.</p></li><li><p><em>Sl&aring; av Wi-Fi: </em>Klikk p&aring; symbolet for Wi-Fi-menyen, og velg deretter Sl&aring; av Wi-Fi.</p></li><li><p><em>Koble til et nettverk: </em>Klikk p&aring; symbolet for Wi-Fi-menyen, og velg deretter et nettverk. Skriv inn passordet for nettverket hvis du blir bedt om det.</p></li><li><p><em>Koble til et lukket nettverk: </em>Klikk p&aring; symbolet for Wi-Fi-menyen, og velg deretter Koble til annet nettverk. Skriv inn navnet p&aring; nettverket og, hvis du blir bedt om det, passordet til nettverket.</p></li></ul></div></div><div id="mchl3fe49482" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl3fe49482"><div class="heading-nobreak"><h2 aria-controls="aria-mchl3fe49482" class="Name">Reparer den interne lagringsdisken</h2><p>Hvis du har problemer med datamaskinen, eller hvis du starter datamaskinen og vinduet for macOS-gjenoppretting vises, m&aring; du kanskje reparere den interne lagringsdisken i datamaskinen (for eksempel en SSD-disk).</p></div><ol><li><p>Velg Diskverkt&oslash;y i Gjenoppretting-programmet, og klikk deretter p&aring; Fortsett.</p></li><li><p>Velg Vis &gt; Vis alle enheter i Diskverkt&oslash;y-programmet.</p></li><li><p>Marker et volum i sidepanelet, og klikk deretter p&aring; F&oslash;rstehjelp-knappen <span class="NoBreak"><img src="../SharedGlobalArt/IL_Stethoscope.png" alt="" height="30" width="37">.</span></p></li><li><p>Klikk p&aring; Start i F&oslash;rstehjelp-dialogruten, og f&oslash;lg deretter instruksjonene p&aring; skjermen.</p></li><li><p>N&aring;r F&oslash;rstehjelp-prosessen er fullf&oslash;rt, klikker du p&aring; Ferdig.</p></li><li><p>Gjenta trinn 3 til 5 for hvert volum p&aring; lagringsenheten.</p></li><li><p>Marker en beholder i sidepanelet, og klikk deretter p&aring; F&oslash;rstehjelp-knappen <span class="NoBreak"><img src="../SharedGlobalArt/IL_Stethoscope.png" alt="" height="30" width="37">.</span></p></li><li><p>Klikk p&aring; Start i F&oslash;rstehjelp-dialogruten, og f&oslash;lg deretter instruksjonene p&aring; skjermen.</p></li><li><p>N&aring;r F&oslash;rstehjelp-prosessen er fullf&oslash;rt, klikker du p&aring; Ferdig.</p></li><li><p>Gjenta trinn 7 til 9 for hver beholder p&aring; lagringsenheten.</p></li><li><p>Marker lagringsenheten i sidepanelet, og klikk deretter p&aring; F&oslash;rstehjelp-knappen <span class="NoBreak"><img src="../SharedGlobalArt/IL_Stethoscope.png" alt="" height="30" width="37">.</span></p></li><li><p>Klikk p&aring; Start i F&oslash;rstehjelp-dialogruten, og f&oslash;lg deretter instruksjonene p&aring; skjermen.</p></li><li><p>N&aring;r F&oslash;rstehjelp-prosessen er fullf&oslash;rt, klikker du p&aring; Ferdig.</p></li></ol><p>Hvis Diskverkt&oslash;y ikke klarer &aring; reparere disken, b&oslash;r du sikkerhetskopiere s&aring; mye av innholdet ditt som mulig og deretter f&oslash;lge instruksjonene i <a href="#mchl0e4c30d6" class="xRef Task">Slett macOS og installer det p&aring; nytt</a>.</p><p>Velg Diskverkt&oslash;y &gt; Avslutt Diskverkt&oslash;y for &aring; g&aring; tilbake til Gjenoppretting-programmet.</p></div></div><div id="mchlf4cdcc0f" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchlf4cdcc0f"><div class="heading-nobreak"><h2 aria-controls="aria-mchlf4cdcc0f" class="Name">Bruk Time Machine til &aring; gjenopprette systemet</h2><p>Hvis du tidligere har opprettet en Time Machine-sikkerhetskopi, bruker du Gjenopprett fra Time Machine-sikkerhetskopi for &aring; gjenopprette alt p&aring; datamaskinen.</p></div><div class="Alert"><p class="Important"><strong>Viktig: </strong>Time Machine-sikkerhetskopien skal kun brukes til &aring; gjenopprette informasjon p&aring; datamaskinen som er kilden til sikkerhetskopien. Hvis du vil overf&oslash;re informasjon fra denne Macen til en ny datamaskin, avslutter du macOS-gjenoppretting, starter Macen p&aring; nytt og bruker Overf&oslash;ringsassistent-programmet i macOS.</p></div><ol><li><p>Hvis sikkerhetskopien er p&aring; en Time Capsule, m&aring; du forsikre deg om at du er tilkoblet internett.</p></li><li><p>Velg Gjenopprett fra Time Machine-sikkerhetskopi i Gjenoppretting-programmet, og klikk deretter p&aring; Fortsett.</p></li><li><p>F&oslash;lg instruksjonene p&aring; skjermen i Time Machine-systemgjenoppretting.</p></li></ol></div></div><div id="mchl57249f89" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl57249f89"><div class="heading-nobreak"><h2 aria-controls="aria-mchl57249f89" class="Name">Installer macOS p&aring; nytt</h2><p>I noen tilfeller kan det v&aelig;re du m&aring; installere macOS p&aring; nytt. Du kan installere macOS p&aring; nytt og likevel beholde filer og brukerinnstillinger.</p></div><ol><li><p>Forsikre deg om at du er koblet til internett.</p></li><li><p>Velg Installer macOS Big Sur p&aring; nytt i Gjenoppretting-programmet, og klikk deretter p&aring; Fortsett.</p><div class="Alert"><p class="Important"><strong>Viktig:</strong> I panelet der du markerer en disk, markerer du gjeldende macOS-disk (i de fleste tilfeller er det den eneste som er tilgjengelig).</p></div></li><li><p>F&oslash;lg instruksjonene p&aring; skjermen.</p></li></ol></div></div><div id="mchl0e4c30d6" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl0e4c30d6"><div class="heading-nobreak"><h2 aria-controls="aria-mchl0e4c30d6" class="Name">Slett macOS og installer det p&aring; nytt</h2><p>Hvis du sletter macOS og installerer det p&aring; nytt, blir brukerkontoene dine, nettverksinnstillinger og alle filer og mapper p&aring; Macen slettet. F&oslash;r du sletter macOS, b&oslash;r du pr&oslash;ve &aring; logge p&aring; systemet og deretter sikkerhetskopiere filer du &oslash;nsker &aring; beholde, ved &aring; kopiere dem til en annen lagringsenhet. Skriv ogs&aring; ned nettverksinnstillingene dine i Nettverk-valg for &aring; gj&oslash;re det enklere &aring; koble til igjen etter at macOS er installert p&aring; nytt.</p></div><ol><li><p>Forsikre deg om at du er koblet til internett.</p></li><li><p>Klikk p&aring; Diskverkt&oslash;y i Gjenoppretting-programmet, og klikk deretter p&aring; Fortsett.</p></li><li><p>Marker det volumet du vil slette, i sidepanelet i Diskverkt&oslash;y, og klikk deretter p&aring; Slett-knappen i verkt&oslash;ylinjen.</p></li><li><p>Skriv inn et navn p&aring; volumet i Navn-feltet.</p></li><li><p>Klikk p&aring; Format-lokalmenyen, velg APFS, og klikk deretter p&aring; Slett volumgruppe.</p></li><li><p>N&aring;r sletteprosessen er fullf&oslash;rt, klikker du p&aring; Ferdig og velger Diskverkt&oslash;y &gt; Avslutt Diskverkt&oslash;y.</p></li><li><p>Velg Installer macOS Big Sur p&aring; nytt i Gjenoppretting-programmet, klikk p&aring; Fortsett og f&oslash;lg deretter instruksjonene p&aring; skjermen.</p></li></ol></div></div><div id="mchl9b13cbdc" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl9b13cbdc"><div class="heading-nobreak"><h2 aria-controls="aria-mchl9b13cbdc" class="Name">Angi sikkerhetsregler</h2><ol><li><p>Velg Verkt&oslash;y &gt; Oppstartssikkerhetsverkt&oslash;y i Gjenoppretting-programmet.</p></li><li><p>Marker systemet du vil angi sikkerhetsregler for.</p></li><li><p>Hvis disken er kryptert med FileVault, klikker du p&aring; L&aring;s opp, skriver inn passordet og klikker p&aring; L&aring;s opp.</p></li><li><p>Klikk p&aring; Sikkerhetsregler.</p></li><li><p>Vurder f&oslash;lgende sikkerhetsalternativer:</p><ul><li><p><em>Full sikkerhet: </em>Sikrer at bare gjeldende OS, eller signert operativsystemprogramvare som er godkjent av Apple p&aring; det n&aring;v&aelig;rende tidspunktet, kan kj&oslash;res. Denne modusen krever en nettverkstilkobling under installering av programvare.</p></li><li><p><em>Redusert sikkerhet:</em> Tillater en hvilken som helst versjon av signert operativsystemprogramvare som noensinne har v&aelig;rt godkjent av Apple til &aring; kj&oslash;res.</p></li></ul></li><li><p>Hvis n&oslash;dvendig, velger du Redusert sikkerhet, oppgir administratorbrukernavnet og passordet og gj&oslash;r ett av f&oslash;lgende:</p><ul><li><p>Marker avkrysningsruten «Tillat brukeradministrering av kjerneutvidelser fra identifiserte utvilklere» hvis du vil tillate installering av programvare som bruker eldre kjerneutvidelser.</p></li><li><p>Marker avkrysningsruten «Tillat ekstern administrering av kjerneutvidelser og automatiske programvareoppdateringer» hvis du vil autorisere ekstern administrering av eldre kjerneutvidelser og programvareoppdateringer ved hjelp av en MDM-l&oslash;sning (Mobile Device Management).</p></li></ul></li><li><p>Klikk p&aring; OK.</p></li><li><p>Du m&aring; ta en omstart p&aring; Macen for at endringene skal tre i kraft.</p></li></ol></div></div></div><div id="mchl6e3b9225" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl6e3b9225"><div class="heading-nobreak"><h2 aria-controls="aria-mchl6e3b9225" class="Name">Bruk Del disk til &aring; overf&oslash;re filer mellom to Mac-datamaskiner</h2><p>Du kan overf&oslash;re filer mellom en Mac som er startet i macOS-gjenoppretting, og en annen Mac ved &aring; dele et volum og koble de to datamaskinene sammen med en USB-, USB-C- eller Thunderbolt-kabel.</p></div><ol><li><p>Koble de to datamaskinene sammen med en USB-, USB-C- eller Thunderbolt-kabel.</p></li><li><p>Velg Verkt&oslash;y &gt; Del disk i Gjenoppretting-programmet.</p></li><li><p>Marker volumet du vil dele, og klikk deretter p&aring; Start deling.</p></li><li><p>P&aring; den andre Macen &aring;pner du et Finder-vindu og klikker p&aring; Nettverk i sidepanelet under Plasseringer.</p></li><li><p>I Nettverk-vinduet dobbeltklikker du p&aring; Macen med den delte disken, klikker p&aring; Koble til som, markerer Gjest i Koble til som-vinduet og klikker p&aring; Koble til.</p></li><li><p>Overf&oslash;r filene.</p></li><li><p>N&aring;r du er ferdig med &aring; overf&oslash;re filer, mater du ut volumet p&aring; den andre Macen.</p></li></ol></div></div><div id="mchl2a21e30c" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl2a21e30c"><div class="heading-nobreak"><h2 aria-controls="aria-mchl2a21e30c" class="Name">Vis Gjenoppretting-loggen</h2><p>Gjenoppretting-loggen inneholder meldinger logget av macOS-gjenoppretting. Du kan spesifisere hvilke typer meldinger du vil vise, filtrere meldinger for &aring; s&oslash;ke etter bestemt tekst samt arkivere Gjenoppretting-loggen til en fil.</p></div><ol><li><p>Velg Vindu &gt; Gjenoppretting-logg i Gjenoppretting-programmet.</p></li><li><p>Klikk p&aring; Detaljniv&aring;-lokalmenyen, og velg deretter hva slags meldinger du vil vise:</p><ul><li><p><em>Vis kun feil: </em>Velg dette alternativet for &aring; vise kun feilmeldinger.</p></li><li><p><em>Vis feil og framdrift: </em>Velg dette alternativet for &aring; vise feilmeldinger og framdriftsmeldinger.</p></li><li><p><em>Vis alle logger: </em>Velg dette alternativet for &aring; vise alle meldinger.</p></li></ul></li><li><p>For &aring; filtrere meldinger m&aring; du skrive inn s&oslash;keteksten i Filter-feltet.</p></li><li><p>For &aring; arkivere Gjenoppretting-loggen m&aring; du klikke p&aring; Arkiver-knappen, velge en plassering for filen og deretter klikke p&aring; Arkiver.</p></li><li><p>N&aring;r du er ferdig med &aring; se p&aring; Gjenoppretting-loggen, klikker du p&aring; Lukk-knappen <img src="../SharedGlobalArt/IL_XMarkBlackCircleFillRed.png" alt="" height="30" width="30"> &oslash;verst til venstre i vinduet.</p></li></ol></div></div><div id="mchl4ee3f192" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl4ee3f192"><div class="heading-nobreak"><h2 aria-controls="aria-mchl4ee3f192" class="Name">Opprett en diagnostikkfil for gjenopprettingen</h2><p>Hvis du sender inn en problemrapport ved hjelp av Tilbakemeldingsassistent, kan du bli spurt om &aring; sende en diagnostikkfil for gjennopprettingen. Du kan opprette filen og arkivere den p&aring; en ekstern lagringsenhet.</p></div><ol><li><p>Koble en ekstern lagringsenhet til Macen.</p></li><li><p>Hold nede Kontroll-Tilvalg-Skift-Kommando-punktum.</p></li><li><p>N&aring;r skjermen blinker, m&aring; du vente et lite &oslash;yeblikk til en dialogrute vises.</p></li><li><p>Bruk dialogruten til &aring; arkivere diagnostikkfilen fra Gjenoppretting til en plassering p&aring; den eksterne lagringsenheten.</p></li></ol></div></div><div id="mchlb7e93c86" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchlb7e93c86"><div class="heading-nobreak"><h2 aria-controls="aria-mchlb7e93c86" class="Name">Avslutt macOS-gjenoppretting</h2><p>Macen starter automatisk p&aring; nytt mens den gjenoppretter systemet fra Time Machine eller installerer macOS p&aring; nytt. I andre tilfeller m&aring; du kanskje avslutte macOS-gjenoppretting manuelt (for eksempel hvis du vil sikkerhetskopiere filene dine f&oslash;r du installerer macOS p&aring; nytt, eller hvis du nettopp har endret en innstilling ved hjelp av Oppstartssikkerhetsverkt&oslash;y).</p></div><p>Gj&oslash;r ett av f&oslash;lgende p&aring; Macen:</p><ul><li><p><em>Start Macen p&aring; nytt: </em>Velg Apple-menyen <img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"> &gt; Omstart.</p></li><li><p><em>Velg en annen startdisk f&oslash;r du starter Macen p&aring; nytt: </em>Velg Apple-menyen <img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"> &gt; Startdisk, marker en startdisk, og klikk deretter p&aring; Omstart.</p></li><li><p><em>Sl&aring; av Macen: </em>Velg Apple-menyen <img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"> &gt; Sl&aring; av.</p></li></ul></div></div></header><main></main><footer><p>Copyright © 2021 Apple Inc. Alle rettigheter forbeholdes.</p></footer><script type="text/javascript" src="../js/static.js"></script></body></html>