<html lang="en"><head><meta charset="utf-8"><title>R&eacute;cup&eacute;ration - Invit&eacute;s</title><link rel="stylesheet" type="text/css" href="../css/static.css"></head><body class="apd-topic" dir="ltr" data-isTaskOpen="true"><header role="presentation" id="mchl9b252c37" class="AppleTopic"><figure class="topicIcon"><img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"></figure><h1>Informations pour les utilisateurs invit&eacute;s sur Mac</h1><p>Lorsque vous ouvrez une session en tant qu&rsquo;invit&eacute; sur un Mac sur lequel FileVault est activ&eacute;, vous ne pouvez utiliser que Safari. Les autres apps install&eacute;es sur le Mac ne sont pas accessibles.</p><p>Lorsque vous fermez la session, tous les fichiers que vous avez cr&eacute;&eacute;s sont supprim&eacute;s.</p><div id="mchl696031c7" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl696031c7"><div class="heading-nobreak"><h2 aria-controls="aria-mchl696031c7" class="Name">Se connecter &agrave; Internet</h2><p>Si l&rsquo;ic&ocirc;ne de menu Wi-Fi (dans le coin sup&eacute;rieur droit de l&rsquo;&eacute;cran) contient une ou plusieurs barres <span class="NoBreak"><img src="../SharedGlobalArt/IL_Wifi.png" alt="" height="30" width="42">, </span>cela signifie que le Wi-Fi est activ&eacute; et connect&eacute; &agrave; un r&eacute;seau sans fil. Si l&rsquo;ic&ocirc;ne de menu Wi-Fi ne contient aucune barre <span class="NoBreak"><img src="../SharedGlobalArt/IL_WiFiNoBars.png" alt="" height="30" width="41">, </span>cela signifie que le Wi-Fi est activ&eacute; mais n&rsquo;est pas connect&eacute; &agrave; un r&eacute;seau sans fil. Si l&rsquo;ic&ocirc;ne de menu Wi-Fi est barr&eacute;e <span class="NoBreak"><img src="../SharedGlobalArt/IL_WifiSlash.png" alt="" height="30" width="34">, </span>cela signifie que le Wi-Fi est d&eacute;sactiv&eacute;. Le Wi-Fi doit &ecirc;tre activ&eacute; avant que vous puissiez vous connecter &agrave; un r&eacute;seau sans fil.</p></div><p>Sur votre Mac, effectuez l&rsquo;une des op&eacute;rations suivantes&nbsp;:</p><ul><li><p><em>Pour activer ou d&eacute;sactiver le Wi-Fi&nbsp;: </em>cliquez sur l&rsquo;ic&ocirc;ne de menu Wi-Fi, puis cliquez sur le commutateur Wi-Fi.</p></li><li><p><em>Pour vous connecter &agrave; un r&eacute;seau&nbsp;: </em>cliquez sur l&rsquo;ic&ocirc;ne de menu Wi-Fi, puis choisissez un r&eacute;seau. Si vous y &ecirc;tes invit&eacute;, saisissez le mot de passe du r&eacute;seau.</p></li></ul></div></div><div id="mchl50efec91" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl50efec91"><div class="heading-nobreak"><h2 aria-controls="aria-mchl50efec91" class="Name">Se d&eacute;connecter d&rsquo;un compte «&nbsp;Utilisateur invit&eacute;&nbsp;»</h2><p>Une fois que vous avez termin&eacute; d&rsquo;utiliser le Mac, d&eacute;connectez-vous du compte «&nbsp;Utilisateur invit&eacute;&nbsp;».</p></div><ol><li><p>Sur votre Mac, choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; Fermer la session Utilisateur invit&eacute;.</p></li><li><p>Lisez les informations pr&eacute;sent&eacute;es dans la zone de dialogue d&rsquo;avertissement, puis effectuez l&rsquo;une des op&eacute;rations suivantes&nbsp;:</p><ul><li><p><em>Pour fermer la session&nbsp;: </em>cliquez sur «&nbsp;Supprimer et se d&eacute;connecter&nbsp;».</p></li><li><p><em>Pour copier vos fichiers&nbsp;: </em>cliquez sur Annuler, puis copiez vos fichiers sur un autre support de stockage, comme une cl&eacute; USB.</p></li></ul></li></ol></div></div></header><main></main><footer><p>Copyright&nbsp;© 2021 Apple&nbsp;Inc. Tous droits r&eacute;serv&eacute;s.</p></footer><script type="text/javascript" src="../js/static.js"></script></body></html>