<html lang="en"><head><meta charset="utf-8"><title>R&eacute;cup&eacute;ration - Puce Apple</title><link rel="stylesheet" type="text/css" href="../css/static.css"></head><body class="apd-topic" dir="ltr" data-isTaskOpen="true"><header role="presentation" id="mchl82829c17" class="AppleTopic"><figure class="topicIcon"><img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"></figure><h1>Utiliser la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS sur un Mac avec puce Apple</h1><p>La fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS est le syst&egrave;me de r&eacute;cup&eacute;ration int&eacute;gr&eacute; de votre Mac.</p><p>Vous pouvez utiliser les apps disponibles dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS sur un Mac avec puce Apple pour r&eacute;parer votre disque interne, r&eacute;installer macOS, restaurer vos fichiers &agrave; partir d&rsquo;une sauvegarde Time&nbsp;Machine, d&eacute;finir le r&egrave;glement de s&eacute;curit&eacute; des diff&eacute;rents disques, transf&eacute;rer des fichiers entre deux ordinateurs Mac, d&eacute;marrer en mode sans &eacute;chec, et plus encore.</p><p>La r&eacute;installation de macOS n&eacute;cessite une connexion &agrave; Internet. Pour vous connecter &agrave; Internet, vous pouvez utiliser une connexion r&eacute;seau sans fil ou c&acirc;bl&eacute;e. Consultez la rubrique <a href="#mchle9d1cb3c" class="xRef Task">Se connecter &agrave; Internet en Wi-Fi</a>.</p><div class="Alert"><p class="Note"><em>Remarque&nbsp;: </em>si vous tentez de vous connecter &agrave; un portail captif (dans un caf&eacute;, une biblioth&egrave;que ou un h&ocirc;tel, par exemple) ou &agrave; un r&eacute;seau d&rsquo;entreprise, il se peut que vous ne puissiez pas acc&eacute;der &agrave; Internet dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS.</p></div><div id="mchla906a106" class="Subhead"><div class="heading-nobreak"><h2 class="Name">Apps disponibles dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS sur un Mac avec puce Apple</h2><p>Les apps suivantes sont disponibles dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS sur un Mac avec puce Apple&nbsp;:</p></div><ul><li><p><em>R&eacute;cup&eacute;ration&nbsp;: </em>l&rsquo;app R&eacute;cup&eacute;ration permet d&rsquo;acc&eacute;der &agrave; des apps suppl&eacute;mentaires dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS. Consultez les rubriques <a href="#mchl5abfbb29" class="xRef Task">D&eacute;marrer l&rsquo;ordinateur &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS</a>, <a href="#mchldc3556ed" class="xRef Task">D&eacute;marrer l&rsquo;ordinateur &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS et jumeler des p&eacute;riph&eacute;riques d&rsquo;entr&eacute;e Bluetooth</a> et <a href="#mchlb7e93c86" class="xRef Task">Quitter la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS</a>.</p></li><li><p><em>Restauration syst&egrave;me Time&nbsp;Machine&nbsp;: </em>restaurez vos donn&eacute;es &agrave; partir d&rsquo;une sauvegarde Time&nbsp;Machine. Dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez «&nbsp;Restaurer &agrave; partir de Time&nbsp;Machine&nbsp;», puis cliquez sur Continuer. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Restauration syst&egrave;me Time&nbsp;Machine&nbsp;&gt; Quitter la restauration syst&egrave;me Time&nbsp;Machine. Consultez la rubrique <a href="#mchlf4cdcc0f" class="xRef Task">Utiliser Time&nbsp;Machine pour restaurer le syst&egrave;me</a>.</p></li><li><p><em>Installer macOS&nbsp;: </em>r&eacute;installez macOS sur votre ordinateur. Dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez «&nbsp;R&eacute;installler macOS&nbsp;», puis cliquez sur Continuer. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Installer macOS Big Sur&nbsp;&gt; Quitter Installer macOS. Consultez la rubrique <a href="#mchl57249f89" class="xRef Task">R&eacute;installer macOS</a>.</p></li><li><p><em>Safari&nbsp;: </em>dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez Safari, puis cliquez sur Continuer. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Safari&nbsp;&gt; Quitter Safari. Si vous &ecirc;tes connect&eacute; &agrave; Internet, vous pouvez utiliser Safari pour rechercher de plus amples informations sur le site web d&rsquo;assistance Apple. Notez que les modules et les extensions du navigateur Safari sont d&eacute;sactiv&eacute;s dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS.</p></li><li><p><em>Utilitaire de disque&nbsp;: </em>r&eacute;parez ou effacez votre disque. Dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez «&nbsp;Utilitaire de disque&nbsp;», puis cliquez sur Continuer. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaire de disque&nbsp;&gt; Quitter Utilitaire de disque. Consultez les rubriques <a href="#mchl0e4c30d6" class="xRef Task">Effacer et r&eacute;installer macOS</a> et <a href="#mchl3fe49482" class="xRef Task">R&eacute;parer le p&eacute;riph&eacute;rique de stockage interne</a>.</p></li><li><p><em>Utilitaire S&eacute;curit&eacute; au d&eacute;marrage&nbsp;: </em>d&eacute;finissez les r&egrave;glements de s&eacute;curit&eacute; de votre Mac. Dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaires&nbsp;&gt; Utilitaire S&eacute;curit&eacute; au d&eacute;marrage. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaire S&eacute;curit&eacute; au d&eacute;marrage&nbsp;&gt; Quitter Utilitaire S&eacute;curit&eacute; au d&eacute;marrage. Consultez la rubrique <a href="#mchl9b13cbdc" class="xRef Task">D&eacute;finir le r&egrave;glement de s&eacute;curit&eacute;</a>.</p></li><li><p><em>Terminal&nbsp;: </em>modifiez des r&eacute;glages via la ligne de commande. Dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaires&nbsp;&gt; Terminal. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Terminal&nbsp;&gt; Quitter Terminal.</p></li><li><p><em>Partager un disque&nbsp;: </em>partagez le disque d&rsquo;un Mac d&eacute;marr&eacute; &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS. Dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaires&nbsp;&gt; Partager un disque. Consultez la rubrique <a href="#mchl6e3b9225" class="xRef Task">Utiliser «&nbsp;Partager un disque&nbsp;» pour transf&eacute;rer des fichiers entre deux ordinateurs Mac</a>.</p></li><li><p><em>Disque de d&eacute;marrage&nbsp;: </em>d&eacute;finissez le disque de d&eacute;marrage du Mac. Choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; Disque de d&eacute;marrage. Pour quitter l&rsquo;app, choisissez Disque de d&eacute;marrage&nbsp;&gt; Quitter Disque de d&eacute;marrage.</p></li></ul></div><p>Vous pouvez &eacute;galement utiliser la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS pour effectuer les t&acirc;ches suivantes&nbsp;:</p><ul><li><p><a href="#mchl08ae9930" class="xRef Task">D&eacute;marrer l&rsquo;ordinateur en mode sans &eacute;chec</a></p></li><li><p><a href="#mchlbcf8b54b" class="xRef Task">D&eacute;finir le volume de d&eacute;marrage par d&eacute;faut et red&eacute;marrer l&rsquo;ordinateur</a></p></li><li><p><a href="#mchl2a21e30c" class="xRef Task">Consulter l&rsquo;historique de r&eacute;cup&eacute;ration</a></p></li><li><p><a href="#mchl4ee3f192" class="xRef Task">Cr&eacute;er un fichier de diagnostic de r&eacute;cup&eacute;ration</a></p></li></ul><div id="mchl5abfbb29" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl5abfbb29"><div class="heading-nobreak"><h2 aria-controls="aria-mchl5abfbb29" class="Name">D&eacute;marrer l&rsquo;ordinateur &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS</h2><ol><li><p>Choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; &Eacute;teindre.</p></li><li><p>Maintenez enfonc&eacute; le bouton d&rsquo;alimentation de votre Mac jusqu&rsquo;&agrave; ce que le message «&nbsp;Chargement des options de d&eacute;marrage&nbsp;» apparaisse.</p></li><li><p>Cliquez sur Options, puis sur Continuer.</p></li><li><p>Saisissez le mot de passe d&rsquo;un compte administrateur.</p></li></ol></div></div></div><div id="mchldc3556ed" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchldc3556ed"><div class="heading-nobreak"><h2 aria-controls="aria-mchldc3556ed" class="Name">D&eacute;marrer l&rsquo;ordinateur &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS et jumeler des p&eacute;riph&eacute;riques d&rsquo;entr&eacute;e Bluetooth</h2><p>Proc&eacute;dez comme suit si vous devez jumeler un clavier, un trackpad ou une souris Bluetooth avec votre Mac lorsque vous d&eacute;marrez &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS.</p></div><ol><li><p>Choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; &Eacute;teindre.</p></li><li><p>Maintenez enfonc&eacute; le bouton d&rsquo;alimentation de votre Mac jusqu&rsquo;&agrave; ce que le message «&nbsp;Chargement des options de d&eacute;marrage&nbsp;» apparaisse.</p></li><li><p>Lorsque le volume syst&egrave;me et le bouton Options apparaissent, appuyez trois fois sur le bouton d&rsquo;alimentation.</p><div class="Alert"><p class="Note"><em>Remarque&nbsp;: </em>les diff&eacute;rentes pressions sur le bouton d&rsquo;alimentation doivent &ecirc;tre espac&eacute;es d&rsquo;environ 1&nbsp;seconde. Si vous appuyez trop rapidement sur le bouton d&rsquo;alimentation, l&rsquo;op&eacute;ration ne sera pas prise en compte, car les suites d&rsquo;appuis rapides sont r&eacute;serv&eacute;es &agrave; d&rsquo;autres usages, comme VoiceOver.</p></div></li><li><p>Utilisez Assistant r&eacute;glages Bluetooth pour jumeler vos accessoires Bluetooth avec votre Mac.</p><div class="Alert"><p class="Note"><em>Remarque&nbsp;: </em>Assistant r&eacute;glages Bluetooth n&rsquo;est pas disponible si un p&eacute;riph&eacute;rique d&rsquo;entr&eacute;e est d&eacute;j&agrave; connect&eacute;.</p></div></li><li><p>Saisissez le mot de passe d&rsquo;un compte administrateur.</p></li></ol></div></div><div id="mchl08ae9930" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl08ae9930"><div class="heading-nobreak"><h2 aria-controls="aria-mchl08ae9930" class="Name">D&eacute;marrer l&rsquo;ordinateur en mode sans &eacute;chec</h2><ol><li><p>Choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; &Eacute;teindre.</p></li><li><p>Maintenez enfonc&eacute; le bouton d&rsquo;alimentation de votre Mac jusqu&rsquo;&agrave; ce que le message «&nbsp;Chargement des options de d&eacute;marrage&nbsp;» apparaisse.</p></li><li><p>S&eacute;lectionnez un volume.</p></li><li><p>Maintenez enfonc&eacute;e la touche Maj, puis cliquez sur «&nbsp;Continuer en mode sans &eacute;chec&nbsp;».</p><p>L&rsquo;ordinateur red&eacute;marre automatiquement.</p></li></ol></div></div></div><div id="mchlbcf8b54b" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchlbcf8b54b"><div class="heading-nobreak"><h2 aria-controls="aria-mchlbcf8b54b" class="Name">D&eacute;finir le volume de d&eacute;marrage par d&eacute;faut et red&eacute;marrer l&rsquo;ordinateur</h2><ol><li><p>Choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; &Eacute;teindre.</p></li><li><p>Maintenez enfonc&eacute; le bouton d&rsquo;alimentation de votre Mac jusqu&rsquo;&agrave; ce que le message «&nbsp;Chargement des options de d&eacute;marrage&nbsp;» apparaisse.</p></li><li><p>S&eacute;lectionnez un volume.</p></li><li><p>Maintenez enfonc&eacute;e la touche Option, puis cliquez sur «&nbsp;Toujours utiliser&nbsp;».</p><p>L&rsquo;ordinateur red&eacute;marre automatiquement.</p></li></ol></div></div></div><div id="mchle9d1cb3c" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchle9d1cb3c"><div class="heading-nobreak"><h2 aria-controls="aria-mchle9d1cb3c" class="Name">Se connecter &agrave; Internet en Wi-Fi</h2><p>Si l&rsquo;ic&ocirc;ne de menu Wi-Fi (dans le coin sup&eacute;rieur droit de l&rsquo;&eacute;cran) contient une ou plusieurs barres <span class="NoBreak"><img src="../SharedGlobalArt/IL_Wifi.png" alt="" height="30" width="42">, </span>cela signifie que le Wi-Fi est activ&eacute; et connect&eacute; &agrave; un r&eacute;seau sans fil. Si l&rsquo;ic&ocirc;ne de menu Wi-Fi ne contient aucune barre <span class="NoBreak"><img src="../SharedGlobalArt/IL_WiFiNoBars.png" alt="" height="30" width="41">, </span>cela signifie que le Wi-Fi est activ&eacute; mais n&rsquo;est pas connect&eacute; &agrave; un r&eacute;seau sans fil. Si l&rsquo;ic&ocirc;ne de menu Wi-Fi est barr&eacute;e <span class="NoBreak"><img src="../SharedGlobalArt/IL_WifiSlash.png" alt="" height="30" width="34">, </span>cela signifie que le Wi-Fi est d&eacute;sactiv&eacute;. Le Wi-Fi doit &ecirc;tre activ&eacute; avant que vous puissiez vous connecter &agrave; un r&eacute;seau sans fil.</p></div><p>Sur votre Mac, effectuez l&rsquo;une des op&eacute;rations suivantes&nbsp;:</p><ul><li><p><em>Pour activer le Wi-Fi&nbsp;: </em>cliquez sur l&rsquo;ic&ocirc;ne de menu Wi-Fi, puis choisissez «&nbsp;Activer le Wi-Fi&nbsp;».</p></li><li><p><em>Pour d&eacute;sactiver le Wi-Fi&nbsp;: </em>cliquez sur l&rsquo;ic&ocirc;ne de menu Wi-Fi, puis choisissez «&nbsp;D&eacute;sactiver le Wi-Fi&nbsp;».</p></li><li><p><em>Pour vous connecter &agrave; un r&eacute;seau&nbsp;: </em>cliquez sur l&rsquo;ic&ocirc;ne de menu Wi-Fi, puis choisissez un r&eacute;seau. Si vous y &ecirc;tes invit&eacute;, saisissez le mot de passe du r&eacute;seau.</p></li><li><p><em>Pour vous connecter &agrave; un r&eacute;seau ferm&eacute;&nbsp;: </em>cliquez sur l&rsquo;ic&ocirc;ne de menu Wi-Fi, puis choisissez «&nbsp;Se connecter &agrave; un autre r&eacute;seau&nbsp;». Saisissez le nom du r&eacute;seau et, si vous y &ecirc;tes invit&eacute;, le mot de passe pour y acc&eacute;der.</p></li></ul></div></div><div id="mchl3fe49482" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl3fe49482"><div class="heading-nobreak"><h2 aria-controls="aria-mchl3fe49482" class="Name">R&eacute;parer le p&eacute;riph&eacute;rique de stockage interne</h2><p>Si vous rencontrez des probl&egrave;mes avec votre ordinateur ou si la fen&ecirc;tre de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS s&rsquo;est affich&eacute;e lors de son d&eacute;marrage, il se peut que vous deviez r&eacute;parer son p&eacute;riph&eacute;rique de stockage interne (par exemple, un SSD).</p></div><ol><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez «&nbsp;Utilitaire de disque&nbsp;», puis cliquez sur Continuer.</p></li><li><p>Dans l&rsquo;app Utilitaire de disque, choisissez Pr&eacute;sentation&nbsp;&gt; Afficher tous les appareils.</p></li><li><p>Dans la barre lat&eacute;rale, s&eacute;lectionnez un volume, puis cliquez sur le bouton S.O.S.&nbsp;<span class="NoBreak"><img src="../SharedGlobalArt/IL_Stethoscope.png" alt="" height="30" width="37">.</span></p></li><li><p>Dans la zone de dialogue S.O.S., cliquez sur Ex&eacute;cuter, puis suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li><li><p>Une fois le processus S.O.S. termin&eacute;, cliquez sur Termin&eacute;.</p></li><li><p>Recommencez les &eacute;tapes&nbsp;3 &agrave; 5 pour chaque volume du p&eacute;riph&eacute;rique de stockage.</p></li><li><p>Dans la barre lat&eacute;rale, s&eacute;lectionnez un conteneur, puis cliquez sur le bouton S.O.S.&nbsp;<span class="NoBreak"><img src="../SharedGlobalArt/IL_Stethoscope.png" alt="" height="30" width="37">.</span></p></li><li><p>Dans la zone de dialogue S.O.S., cliquez sur Ex&eacute;cuter, puis suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li><li><p>Une fois le processus S.O.S. termin&eacute;, cliquez sur Termin&eacute;.</p></li><li><p>Recommencez les &eacute;tapes&nbsp;7 &agrave; 9 pour chaque conteneur du p&eacute;riph&eacute;rique de stockage.</p></li><li><p>Dans la barre lat&eacute;rale, s&eacute;lectionnez le p&eacute;riph&eacute;rique de stockage, puis cliquez sur le bouton S.O.S.&nbsp;<span class="NoBreak"><img src="../SharedGlobalArt/IL_Stethoscope.png" alt="" height="30" width="37">.</span></p></li><li><p>Dans la zone de dialogue S.O.S., cliquez sur Ex&eacute;cuter, puis suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li><li><p>Une fois le processus S.O.S. termin&eacute;, cliquez sur Termin&eacute;.</p></li></ol><p>Si Utilitaire de disque n&rsquo;est pas en mesure de r&eacute;parer votre disque, sauvegardez autant d&rsquo;informations que possible, puis suivez les instructions de la rubrique <a href="#mchl0e4c30d6" class="xRef Task">Effacer et r&eacute;installer macOS</a>.</p><p>Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaire de disque&nbsp;&gt; Quitter Utilitaire de disque.</p></div></div><div id="mchlf4cdcc0f" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchlf4cdcc0f"><div class="heading-nobreak"><h2 aria-controls="aria-mchlf4cdcc0f" class="Name">Utiliser Time&nbsp;Machine pour restaurer le syst&egrave;me</h2><p>Si vous avez d&eacute;j&agrave; cr&eacute;&eacute; une sauvegarde Time&nbsp;Machine, utilisez «&nbsp;Restaurer &agrave; partir d&rsquo;une sauvegarde Time&nbsp;Machine&nbsp;» pour r&eacute;tablir l&rsquo;&eacute;tat pr&eacute;c&eacute;dent de votre ordinateur.</p></div><div class="Alert"><p class="Important"><strong>Important&nbsp;: </strong>n&rsquo;utilisez votre sauvegarde Time&nbsp;Machine que pour restaurer des donn&eacute;es sur l&rsquo;ordinateur qui est la source de cette sauvegarde. Si vous souhaitez transf&eacute;rer des donn&eacute;es sur un nouvel ordinateur, quittez la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS, red&eacute;marrez votre Mac, puis utilisez l&rsquo;app Assistant migration dans macOS.</p></div><ol><li><p>Si votre sauvegarde se trouve sur une Time&nbsp;Capsule, v&eacute;rifiez que vous &ecirc;tes connect&eacute; &agrave; Internet.</p></li><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez «&nbsp;Restaurer &agrave; partir d&rsquo;une sauvegarde Time&nbsp;Machine&nbsp;», puis cliquez sur Continuer.</p></li><li><p>Dans l&rsquo;app Restauration syst&egrave;me Time&nbsp;Machine, suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li></ol></div></div><div id="mchl57249f89" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl57249f89"><div class="heading-nobreak"><h2 aria-controls="aria-mchl57249f89" class="Name">R&eacute;installer macOS</h2><p>Dans certains cas, il peut &ecirc;tre n&eacute;cessaire de r&eacute;installer macOS. Cette r&eacute;installation peut s&rsquo;effectuer en gardant intacts vos fichiers et r&eacute;glages utilisateur.</p></div><ol><li><p>V&eacute;rifiez que vous &ecirc;tes connect&eacute; &agrave; Internet.</p></li><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, cliquez sur «&nbsp;R&eacute;installler macOS Big&nbsp;Sur&nbsp;», puis sur Continuer.</p><div class="Alert"><p class="Important"><strong>Important&nbsp;:</strong> dans la sous-fen&ecirc;tre permettant de s&eacute;lectionner un disque, s&eacute;lectionnez votre disque macOS actuel (dans la plupart des cas, il s&rsquo;agit du seul disque disponible).</p></div></li><li><p>Suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li></ol></div></div><div id="mchl0e4c30d6" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl0e4c30d6"><div class="heading-nobreak"><h2 aria-controls="aria-mchl0e4c30d6" class="Name">Effacer et r&eacute;installer macOS</h2><p>Si vous effacez puis r&eacute;installez macOS, tous vos comptes utilisateur, r&eacute;glages r&eacute;seau, fichiers et dossiers sont supprim&eacute;s de votre Mac. Avant d&rsquo;effacer macOS, essayez de vous reconnecter &agrave; votre syst&egrave;me, puis sauvegardez tous les fichiers que vous souhaitez conserver en les copiant sur un autre p&eacute;riph&eacute;rique de stockage. Notez &eacute;galement les r&eacute;glages r&eacute;seau d&eacute;finis dans les pr&eacute;f&eacute;rences R&eacute;seau pour vous reconnecter plus facilement apr&egrave;s la r&eacute;installation de macOS.</p></div><ol><li><p>V&eacute;rifiez que vous &ecirc;tes connect&eacute; &agrave; Internet.</p></li><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, cliquez sur «&nbsp;Utilitaire de disque&nbsp;», puis sur Continuer.</p></li><li><p>Dans Utilitaire de disque, s&eacute;lectionnez le volume que vous souhaitez effacer dans la barre lat&eacute;rale, puis cliquez sur le bouton Effacer dans la barre d&rsquo;outils.</p></li><li><p>Saisissez un nom pour le volume dans le champ Nom.</p></li><li><p>Cliquez sur le menu local Format, choisissez APFS, puis cliquez sur «&nbsp;Effacer le groupe de volumes&nbsp;».</p></li><li><p>Une fois le processus d&rsquo;effacement termin&eacute;, cliquez sur Termin&eacute;, puis choisissez Utilitaire de disque&nbsp;&gt; Quitter Utilitaire de disque.</p></li><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, cliquez sur «&nbsp;R&eacute;installler macOS Big&nbsp;Sur&nbsp;», cliquez sur Continuer, puis suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li></ol></div></div><div id="mchl9b13cbdc" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl9b13cbdc"><div class="heading-nobreak"><h2 aria-controls="aria-mchl9b13cbdc" class="Name">D&eacute;finir le r&egrave;glement de s&eacute;curit&eacute;</h2><ol><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaires&nbsp;&gt; Utilitaire S&eacute;curit&eacute; au d&eacute;marrage.</p></li><li><p>S&eacute;lectionnez le syst&egrave;me que vous souhaitez utiliser pour d&eacute;finir le r&egrave;glement de s&eacute;curit&eacute;.</p></li><li><p>Si le disque est chiffr&eacute; avec FileVault, cliquez sur D&eacute;verrouiller, saisissez le mot de passe, puis cliquez sur D&eacute;verrouiller.</p></li><li><p>Cliquez sur «&nbsp;R&egrave;glement de s&eacute;curit&eacute;&nbsp;».</p></li><li><p>Examinez les options de s&eacute;curit&eacute; suivantes&nbsp;:</p><ul><li><p><em>S&eacute;curit&eacute; maximale&nbsp;: </em>garantit que seul votre syst&egrave;me d&rsquo;exploitation actuel, ou votre logiciel de syst&egrave;me d&rsquo;exploitation sign&eacute; actuellement approuv&eacute; par Apple, peut s&rsquo;ex&eacute;cuter. Ce mode requiert une connexion r&eacute;seau au moment de l&rsquo;installation des logiciels.</p></li><li><p><em>S&eacute;curit&eacute; r&eacute;duite&nbsp;:</em> autorise l&rsquo;ex&eacute;cution de toute version d&rsquo;un logiciel de syst&egrave;me d&rsquo;exploitation sign&eacute; ayant d&eacute;j&agrave; &eacute;t&eacute; approuv&eacute; par Apple.</p></li></ul></li><li><p>Si n&eacute;cessaire, s&eacute;lectionnez «&nbsp;S&eacute;curit&eacute; r&eacute;duite&nbsp;», saisissez votre nom d&rsquo;utilisateur et votre mot de passe d&rsquo;administrateur, puis effectuez l&rsquo;une des op&eacute;rations suivantes&nbsp;:</p><ul><li><p>Cochez la case «&nbsp;Autoriser la gestion par les utilisateurs des extensions du noyau provenant de d&eacute;veloppeurs identifi&eacute;s&nbsp;», pour autoriser l&rsquo;installation de logiciels utilisant des extensions de noyau h&eacute;rit&eacute;es.</p></li><li><p>Cochez la case «&nbsp;Autoriser la gestion &agrave; distance des extensions du noyau et des mises &agrave; jour automatiques de logiciels&nbsp;» pour autoriser la gestion &agrave; distance d&rsquo;extensions de noyau h&eacute;rit&eacute;es et des mises &agrave; jour de logiciels au moyen d&rsquo;une solution de gestion des appareils mobiles (MDM).</p></li></ul></li><li><p>Cliquez sur OK.</p></li><li><p>Red&eacute;marrez votre Mac pour que les modifications soient appliqu&eacute;es.</p></li></ol></div></div></div><div id="mchl6e3b9225" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl6e3b9225"><div class="heading-nobreak"><h2 aria-controls="aria-mchl6e3b9225" class="Name">Utiliser «&nbsp;Partager un disque&nbsp;» pour transf&eacute;rer des fichiers entre deux ordinateurs Mac</h2><p>Vous pouvez transf&eacute;rer des fichiers entre un Mac d&eacute;marr&eacute; &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS et un autre Mac en partageant un volume et en connectant les deux ordinateurs &agrave; l&rsquo;aide d&rsquo;un c&acirc;ble USB, USB-C ou Thunderbolt.</p></div><ol><li><p>Connectez les deux ordinateurs &agrave; l&rsquo;aide d&rsquo;un c&acirc;ble USB, USB-C ou Thunderbolt.</p></li><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaires&nbsp;&gt; Partager un disque.</p></li><li><p>S&eacute;lectionnez le volume &agrave; partager, puis cliquez sur «&nbsp;D&eacute;marrer le partage&nbsp;».</p></li><li><p>Sur l&rsquo;autre Mac, ouvrez une fen&ecirc;tre Finder, puis cliquez sur R&eacute;seau dans la barre lat&eacute;rale, sous Emplacements.</p></li><li><p>Dans la fen&ecirc;tre R&eacute;seau, cliquez deux fois sur le Mac contenant le disque partag&eacute;, cliquez sur «&nbsp;Se connecter comme&nbsp;», s&eacute;lectionnez Invit&eacute; dans la fen&ecirc;tre «&nbsp;Se connecter comme&nbsp;», puis cliquez sur «&nbsp;Se connecter&nbsp;».</p></li><li><p>Transf&eacute;rez les fichiers.</p></li><li><p>Une fois le transfert des fichiers termin&eacute;, &eacute;jectez le volume sur l&rsquo;autre Mac.</p></li></ol></div></div><div id="mchl2a21e30c" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl2a21e30c"><div class="heading-nobreak"><h2 aria-controls="aria-mchl2a21e30c" class="Name">Consulter l&rsquo;historique de r&eacute;cup&eacute;ration</h2><p>L&rsquo;historique de r&eacute;cup&eacute;ration contient les messages consign&eacute;s par la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS. Vous pouvez choisir les types de messages &agrave; afficher, filtrer les messages pour rechercher un texte pr&eacute;cis, et enregistrer l&rsquo;historique de r&eacute;cup&eacute;ration sous forme de fichier.</p></div><ol><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Fen&ecirc;tre&nbsp;&gt; Historique de R&eacute;cup&eacute;ration.</p></li><li><p>Cliquez sur le menu local «&nbsp;Niveau de d&eacute;tail&nbsp;», puis choisissez les messages &agrave; afficher&nbsp;:</p><ul><li><p><em>Afficher uniquement les erreurs&nbsp;: </em>choisissez cette option pour n&rsquo;afficher que les messages d&rsquo;erreur.</p></li><li><p><em>Afficher les erreurs et la progression&nbsp;: </em>choisissez cette option pour afficher les messages d&rsquo;erreur et de progression.</p></li><li><p><em>Afficher tout l&rsquo;historique&nbsp;: </em>choisissez cette option pour afficher tous les messages.</p></li></ul></li><li><p>Pour filtrer les messages, saisissez le texte &agrave; rechercher dans le champ Filtre.</p></li><li><p>Pour enregistrer l&rsquo;historique de r&eacute;cup&eacute;ration, cliquez sur le bouton Enregistrer, choisissez un emplacement pour le fichier, puis cliquez sur Enregistrer.</p></li><li><p>Lorsque vous avez termin&eacute; de consulter l&rsquo;historique de r&eacute;cup&eacute;ration, cliquez sur le bouton Fermer&nbsp;<img src="../SharedGlobalArt/IL_XMarkBlackCircleFillRed.png" alt="" height="30" width="30"> dans le coin sup&eacute;rieur gauche de la fen&ecirc;tre.</p></li></ol></div></div><div id="mchl4ee3f192" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl4ee3f192"><div class="heading-nobreak"><h2 aria-controls="aria-mchl4ee3f192" class="Name">Cr&eacute;er un fichier de diagnostic de r&eacute;cup&eacute;ration</h2><p>Si vous signalez un probl&egrave;me &agrave; l&rsquo;aide d&rsquo;Assistant d&rsquo;&eacute;valuation, il peut vous &ecirc;tre demand&eacute; de fournir un fichier de diagnostic de r&eacute;cup&eacute;ration. Vous pouvez cr&eacute;er ce fichier et l&rsquo;enregistrer sur un p&eacute;riph&eacute;rique de stockage externe.</p></div><ol><li><p>Connectez un p&eacute;riph&eacute;rique de stockage externe &agrave; votre Mac.</p></li><li><p>Appuyez sur Contr&ocirc;le&nbsp;+ Option&nbsp;+ Maj&nbsp;+ Commande&nbsp;+ Point.</p></li><li><p>Apr&egrave;s le clignotement de l&rsquo;&eacute;cran, patientez quelques instants jusqu&rsquo;&agrave; ce qu&rsquo;une zone de dialogue apparaisse.</p></li><li><p>Utilisez la zone de dialogue pour enregistrer le fichier de diagnostic de r&eacute;cup&eacute;ration dans un emplacement de votre p&eacute;riph&eacute;rique de stockage externe.</p></li></ol></div></div><div id="mchlb7e93c86" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchlb7e93c86"><div class="heading-nobreak"><h2 aria-controls="aria-mchlb7e93c86" class="Name">Quitter la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS</h2><p>Votre Mac red&eacute;marre automatiquement lors de la restauration de votre syst&egrave;me depuis Time&nbsp;Machine ou lors de la r&eacute;installation de macOS. Dans les autres cas, vous devez quitter manuellement la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS (par exemple, si vous souhaitez sauvegarder vos fichiers avant la r&eacute;installation de macOS ou si vous avez seulement modifi&eacute; un r&eacute;glage &agrave; l&rsquo;aide d&rsquo;Utilitaire S&eacute;curit&eacute; au d&eacute;marrage).</p></div><p>Sur votre Mac, effectuez l&rsquo;une des op&eacute;rations suivantes&nbsp;:</p><ul><li><p><em>Pour red&eacute;marrer votre Mac&nbsp;: </em>choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; Red&eacute;marrer.</p></li><li><p><em>Pour choisir un autre disque de d&eacute;marrage avant de red&eacute;marrer votre Mac&nbsp;: </em>choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; Disque de d&eacute;marrage, s&eacute;lectionnez un disque de d&eacute;marrage, puis cliquez sur Red&eacute;marrer.</p></li><li><p><em>Pour &eacute;teindre votre Mac&nbsp;: </em>choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; &Eacute;teindre.</p></li></ul></div></div></header><main></main><footer><p>Copyright&nbsp;© 2021 Apple&nbsp;Inc. Tous droits r&eacute;serv&eacute;s.</p></footer><script type="text/javascript" src="../js/static.js"></script></body></html>