<html lang="en"><head><meta charset="utf-8"><title>R&eacute;cup&eacute;ration - Intel</title><link rel="stylesheet" type="text/css" href="../css/static.css"></head><body class="apd-topic" dir="ltr" data-isTaskOpen="true"><header role="presentation" id="mchl338cf9a8" class="AppleTopic"><figure class="topicIcon"><img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24"></figure><h1>Utiliser la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS sur un Mac dot&eacute; d&rsquo;un processeur Intel</h1><p>La fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS est le syst&egrave;me de r&eacute;cup&eacute;ration int&eacute;gr&eacute; de votre Mac.</p><p>Vous pouvez utiliser les apps disponibles dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS pour r&eacute;parer votre disque interne, r&eacute;installer macOS, restaurer vos fichiers &agrave; partir d&rsquo;une sauvegarde Time&nbsp;Machine, d&eacute;finir les options de s&eacute;curit&eacute;, et plus encore.</p><p>La r&eacute;installation de macOS n&eacute;cessite une connexion &agrave; Internet. Pour vous connecter &agrave; Internet, vous pouvez utiliser une connexion r&eacute;seau sans fil ou c&acirc;bl&eacute;e. Consultez la rubrique <a href="#mchlbeaa54bc" class="xRef Task">Se connecter &agrave; Internet en Wi-Fi</a>.</p><div class="Alert"><p class="Note"><em>Remarque&nbsp;: </em>si vous tentez de vous connecter &agrave; un portail captif (dans un caf&eacute;, une biblioth&egrave;que ou un h&ocirc;tel, par exemple) ou &agrave; un r&eacute;seau d&rsquo;entreprise, il se peut que vous ne puissiez pas acc&eacute;der &agrave; Internet dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS.</p></div><div id="mchl6317f876" class="Subhead"><div class="heading-nobreak"><h2 class="Name">Apps disponibles dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS sur un Mac dot&eacute; d&rsquo;un processeur Intel</h2><p>Les apps suivantes sont disponibles dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS sur un Mac dot&eacute; d&rsquo;un processeur Intel&nbsp;:</p></div><ul><li><p><em>R&eacute;cup&eacute;ration&nbsp;: </em>l&rsquo;app R&eacute;cup&eacute;ration s&rsquo;ouvre lorsque votre ordinateur d&eacute;marre &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS. Consultez les rubriques <a href="#mchl69906860" class="xRef Task">D&eacute;marrer un Mac dot&eacute; d&rsquo;un processeur Intel &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS</a> et <a href="#mchl6518f21a" class="xRef Task">Quitter la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS</a>.</p></li><li><p><em>Restauration syst&egrave;me Time&nbsp;Machine&nbsp;: </em>restaurez vos donn&eacute;es &agrave; partir d&rsquo;une sauvegarde Time&nbsp;Machine. Dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez «&nbsp;Restaurer &agrave; partir de Time&nbsp;Machine&nbsp;», puis cliquez sur Continuer. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Restauration syst&egrave;me Time&nbsp;Machine&nbsp;&gt; Quitter la restauration syst&egrave;me Time&nbsp;Machine. Consultez la rubrique <a href="#mchl43ee355d" class="xRef Task">Utiliser Time&nbsp;Machine pour restaurer le syst&egrave;me</a>.</p></li><li><p><em>Installer macOS&nbsp;: </em>r&eacute;installez macOS sur votre ordinateur. Dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez «&nbsp;R&eacute;installler macOS&nbsp;», puis cliquez sur Continuer. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Installer macOS Big Sur&nbsp;&gt; Quitter Installer macOS. Consultez la rubrique <a href="#mchlde1a4fd2" class="xRef Task">R&eacute;installer macOS</a>.</p></li><li><p><em>Safari&nbsp;: </em>dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez Safari, puis cliquez sur Continuer. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Safari&nbsp;&gt; Quitter Safari. Si vous &ecirc;tes connect&eacute; &agrave; Internet, vous pouvez utiliser Safari pour rechercher de plus amples informations sur le site web d&rsquo;assistance Apple. Notez que les modules et les extensions du navigateur Safari sont d&eacute;sactiv&eacute;s dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS.</p></li><li><p><em>Utilitaire de disque&nbsp;: </em>r&eacute;parez ou effacez votre disque. Dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez «&nbsp;Utilitaire de disque&nbsp;», puis cliquez sur Continuer. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaire de disque&nbsp;&gt; Quitter Utilitaire de disque. Consultez la rubrique <a href="#mchlcb3af2f6" class="xRef Task">Effacer et r&eacute;installer macOS</a>.</p></li><li><p><em>Utilitaire S&eacute;curit&eacute; au d&eacute;marrage&nbsp;: </em>d&eacute;finissez les r&egrave;glements de s&eacute;curit&eacute; de votre Mac. Dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaires&nbsp;&gt; Utilitaire S&eacute;curit&eacute; au d&eacute;marrage. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaire S&eacute;curit&eacute; au d&eacute;marrage&nbsp;&gt; Quitter Utilitaire S&eacute;curit&eacute; au d&eacute;marrage. Consultez les rubriques <a href="#mchl616f896e" class="xRef Task">Utiliser Utilitaire S&eacute;curit&eacute; au d&eacute;marrage pour d&eacute;finir un mot de passe pour le programme interne</a> et <a href="#mchl4260d54a" class="xRef Task">Utiliser Utilitaire S&eacute;curit&eacute; au d&eacute;marrage pour d&eacute;finir les options de d&eacute;marrage s&eacute;curis&eacute;</a>.</p><p>Les options disponibles dans Utilitaire S&eacute;curit&eacute; au d&eacute;marrage varient en fonction du mod&egrave;le de votre Mac. Consultez les articles <a href="https://support.apple.com/HT208198" class="URL">&Agrave; propos de l&rsquo;utilitaire S&eacute;curit&eacute; au d&eacute;marrage</a> et <a href="https://support.apple.com/HT208862" class="URL">Mod&egrave;les de Mac dot&eacute;s de la puce Apple T2 Security</a> de l&rsquo;assistance Apple.</p></li><li><p><em>Disque de d&eacute;marrage&nbsp;: </em>d&eacute;finissez le disque de d&eacute;marrage de votre Mac. Choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; Disque de d&eacute;marrage. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Disque de d&eacute;marrage&nbsp;&gt; Quitter Disque de d&eacute;marrage.</p></li><li><p><em>Terminal&nbsp;: </em>dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaires&nbsp;&gt; Terminal. Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration, choisissez Terminal&nbsp;&gt; Quitter Terminal.</p></li></ul><p>Vous pouvez &eacute;galement utiliser la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS pour effectuer les t&acirc;ches suivantes&nbsp;:</p><ul><li><p><a href="#mchlb6f6d1d9" class="xRef Task">Consulter l&rsquo;historique de r&eacute;cup&eacute;ration</a></p></li><li><p><a href="#mchl7ed39991" class="xRef Task">Cr&eacute;er un fichier de diagnostic de r&eacute;cup&eacute;ration</a></p></li></ul></div><div id="mchl69906860" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl69906860"><div class="heading-nobreak"><h2 aria-controls="aria-mchl69906860" class="Name">D&eacute;marrer un Mac dot&eacute; d&rsquo;un processeur Intel &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS</h2><ol><li><p>Red&eacute;marrez votre Mac.</p></li><li><p>Appuyez imm&eacute;diatement sur l&rsquo;une des combinaisons de touches suivantes et maintenez les touches enfonc&eacute;es jusqu&rsquo;&agrave; ce que l&rsquo;&eacute;cran de d&eacute;marrage apparaisse&nbsp;:</p><ul><li><p><em>Commande&nbsp;+ R&nbsp;: </em>d&eacute;marrez &agrave; partir du syst&egrave;me de r&eacute;cup&eacute;ration de macOS int&eacute;gr&eacute; &agrave; votre Mac. Utilisez cette combinaison de touches pour r&eacute;installer la derni&egrave;re version de macOS install&eacute;e sur votre syst&egrave;me, ou pour utiliser les autres apps disponibles dans la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS.</p></li><li><p><em>Option&nbsp;+ Commande&nbsp;+ R&nbsp;: </em>d&eacute;marrez &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS sur Internet. Utilisez cette combinaison de touches pour r&eacute;installer macOS et effectuer la mise &agrave; niveau vers la derni&egrave;re version de macOS compatible avec votre Mac.</p></li><li><p><em>Option&nbsp;+ Maj&nbsp;+ Commande&nbsp;+ R&nbsp;: </em>d&eacute;marrez &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS sur Internet. Utilisez cette combinaison de touches pour r&eacute;installer la version de macOS fournie avec votre Mac ou la version la plus proche encore disponible.</p></li></ul></li><li><p>Si un cadenas est affich&eacute;, saisissez le mot de passe de votre Mac.</p></li><li><p>Si plusieurs volumes sont pr&eacute;sents sur votre disque, s&eacute;lectionnez celui que vous souhaitez r&eacute;cup&eacute;rer, puis cliquez sur Suivant.</p></li><li><p>Si vous y &ecirc;tes invit&eacute;, choisissez un compte administrateur, cliquez sur Suivant, saisissez le mot de passe de ce compte, puis cliquez sur Continuer.</p></li></ol></div></div></div><div id="mchlbeaa54bc" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchlbeaa54bc"><div class="heading-nobreak"><h2 aria-controls="aria-mchlbeaa54bc" class="Name">Se connecter &agrave; Internet en Wi-Fi</h2><p>Si l&rsquo;ic&ocirc;ne de menu Wi-Fi (dans le coin sup&eacute;rieur droit de l&rsquo;&eacute;cran) contient une ou plusieurs barres <span class="NoBreak"><img src="../SharedGlobalArt/IL_Wifi.png" alt="" height="30" width="42">, </span>cela signifie que le Wi-Fi est activ&eacute; et connect&eacute; &agrave; un r&eacute;seau sans fil. Si l&rsquo;ic&ocirc;ne de menu Wi-Fi ne contient aucune barre <span class="NoBreak"><img src="../SharedGlobalArt/IL_WiFiNoBars.png" alt="" height="30" width="41">, </span>cela signifie que le Wi-Fi est activ&eacute; mais n&rsquo;est pas connect&eacute; &agrave; un r&eacute;seau sans fil. Si l&rsquo;ic&ocirc;ne de menu Wi-Fi est barr&eacute;e <span class="NoBreak"><img src="../SharedGlobalArt/IL_WifiSlash.png" alt="" height="30" width="34">, </span>cela signifie que le Wi-Fi est d&eacute;sactiv&eacute;. Le Wi-Fi doit &ecirc;tre activ&eacute; avant que vous puissiez vous connecter &agrave; un r&eacute;seau sans fil.</p></div><p>Sur votre Mac, effectuez l&rsquo;une des op&eacute;rations suivantes&nbsp;:</p><ul><li><p><em>Pour activer le Wi-Fi&nbsp;: </em>cliquez sur l&rsquo;ic&ocirc;ne de menu Wi-Fi, puis choisissez «&nbsp;Activer le Wi-Fi&nbsp;».</p></li><li><p><em>Pour d&eacute;sactiver le Wi-Fi&nbsp;: </em>cliquez sur l&rsquo;ic&ocirc;ne de menu Wi-Fi, puis choisissez «&nbsp;D&eacute;sactiver le Wi-Fi&nbsp;».</p></li><li><p><em>Pour vous connecter &agrave; un r&eacute;seau&nbsp;: </em>cliquez sur l&rsquo;ic&ocirc;ne de menu Wi-Fi, puis choisissez un r&eacute;seau. Si vous y &ecirc;tes invit&eacute;, saisissez le mot de passe du r&eacute;seau.</p></li><li><p><em>Pour vous connecter &agrave; un r&eacute;seau ferm&eacute;&nbsp;: </em>cliquez sur l&rsquo;ic&ocirc;ne de menu Wi-Fi, puis choisissez «&nbsp;Se connecter &agrave; un autre r&eacute;seau&nbsp;». Saisissez le nom du r&eacute;seau et, si vous y &ecirc;tes invit&eacute;, le mot de passe pour y acc&eacute;der.</p></li></ul></div></div><div id="mchl7ac77bd4" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl7ac77bd4"><div class="heading-nobreak"><h2 aria-controls="aria-mchl7ac77bd4" class="Name">R&eacute;parer le p&eacute;riph&eacute;rique de stockage interne</h2><p>Si vous rencontrez des probl&egrave;mes avec votre ordinateur ou si la fen&ecirc;tre de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS s&rsquo;est affich&eacute;e lors de son d&eacute;marrage, il se peut que vous deviez r&eacute;parer son p&eacute;riph&eacute;rique de stockage interne (par exemple, un SSD).</p></div><ol><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez «&nbsp;Utilitaire de disque&nbsp;», puis cliquez sur Continuer.</p></li><li><p>Dans l&rsquo;app Utilitaire de disque, choisissez Pr&eacute;sentation&nbsp;&gt; Afficher tous les appareils.</p></li><li><p>Dans la barre lat&eacute;rale, s&eacute;lectionnez un volume, puis cliquez sur le bouton S.O.S.&nbsp;<span class="NoBreak"><img src="../SharedGlobalArt/IL_Stethoscope.png" alt="" height="30" width="37">.</span></p></li><li><p>Dans la zone de dialogue S.O.S., cliquez sur Ex&eacute;cuter, puis suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li><li><p>Une fois le processus S.O.S. termin&eacute;, cliquez sur Termin&eacute;.</p></li><li><p>Recommencez les &eacute;tapes&nbsp;3 &agrave; 5 pour chaque volume du p&eacute;riph&eacute;rique de stockage.</p></li><li><p>Dans la barre lat&eacute;rale, s&eacute;lectionnez un conteneur, puis cliquez sur le bouton S.O.S.&nbsp;<span class="NoBreak"><img src="../SharedGlobalArt/IL_Stethoscope.png" alt="" height="30" width="37">.</span></p></li><li><p>Dans la zone de dialogue S.O.S., cliquez sur Ex&eacute;cuter, puis suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li><li><p>Une fois le processus S.O.S. termin&eacute;, cliquez sur Termin&eacute;.</p></li><li><p>Recommencez les &eacute;tapes&nbsp;7 &agrave; 9 pour chaque conteneur du p&eacute;riph&eacute;rique de stockage.</p></li><li><p>Dans la barre lat&eacute;rale, s&eacute;lectionnez le p&eacute;riph&eacute;rique de stockage, puis cliquez sur le bouton S.O.S.&nbsp;<span class="NoBreak"><img src="../SharedGlobalArt/IL_Stethoscope.png" alt="" height="30" width="37">.</span></p></li><li><p>Dans la zone de dialogue S.O.S., cliquez sur Ex&eacute;cuter, puis suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li><li><p>Une fois le processus S.O.S. termin&eacute;, cliquez sur Termin&eacute;.</p></li></ol><p>Si Utilitaire de disque n&rsquo;est pas en mesure de r&eacute;parer votre disque, sauvegardez autant d&rsquo;informations que possible, puis suivez les instructions de la rubrique <a href="#mchlcb3af2f6" class="xRef Task">Effacer et r&eacute;installer macOS</a>.</p><p>Pour revenir &agrave; l&rsquo;app R&eacute;cup&eacute;ration de macOS, choisissez Utilitaire de disque&nbsp;&gt; Quitter Utilitaire de disque.</p></div></div><div id="mchl43ee355d" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl43ee355d"><div class="heading-nobreak"><h2 aria-controls="aria-mchl43ee355d" class="Name">Utiliser Time&nbsp;Machine pour restaurer le syst&egrave;me</h2><p>Si vous avez d&eacute;j&agrave; cr&eacute;&eacute; une sauvegarde Time&nbsp;Machine, utilisez «&nbsp;Restaurer &agrave; partir d&rsquo;une sauvegarde Time&nbsp;Machine&nbsp;» pour r&eacute;tablir l&rsquo;&eacute;tat pr&eacute;c&eacute;dent de votre ordinateur.</p></div><div class="Alert"><p class="Important"><strong>Important&nbsp;: </strong>n&rsquo;utilisez votre sauvegarde Time&nbsp;Machine que pour restaurer des donn&eacute;es sur l&rsquo;ordinateur qui est la source de cette sauvegarde. Si vous souhaitez transf&eacute;rer des donn&eacute;es sur un nouvel ordinateur, quittez la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS, red&eacute;marrez votre Mac, puis utilisez l&rsquo;app Assistant migration dans macOS.</p></div><ol><li><p>Si votre sauvegarde se trouve sur une Time&nbsp;Capsule, v&eacute;rifiez que vous &ecirc;tes connect&eacute; &agrave; Internet.</p></li><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, s&eacute;lectionnez «&nbsp;Restaurer &agrave; partir d&rsquo;une sauvegarde Time&nbsp;Machine&nbsp;», puis cliquez sur Continuer.</p></li><li><p>Dans l&rsquo;app Restauration syst&egrave;me Time&nbsp;Machine, suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li></ol></div></div><div id="mchl616f896e" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl616f896e"><div class="heading-nobreak"><h2 aria-controls="aria-mchl616f896e" class="Name">Utiliser Utilitaire S&eacute;curit&eacute; au d&eacute;marrage pour d&eacute;finir un mot de passe pour le programme interne</h2><p>La d&eacute;finition d&rsquo;un mot de passe pour le programme interne vous permet d&rsquo;emp&ecirc;cher votre Mac de d&eacute;marrer &agrave; partir d&rsquo;un p&eacute;riph&eacute;rique de stockage interne ou externe autre que le disque de d&eacute;marrage s&eacute;lectionn&eacute; si vous ne saisissez pas le mot de passe du programme interne. Vous pouvez activer, d&eacute;sactiver ou modifier le mot de passe du programme interne &agrave; l&rsquo;aide d&rsquo;Utilitaire S&eacute;curit&eacute; au d&eacute;marrage.</p></div><p>Lorsque le mot de passe du programme interne est activ&eacute;, vous devez le saisir chaque fois que vous d&eacute;marrez votre Mac &agrave; partir de la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS ou d&rsquo;un p&eacute;riph&eacute;rique de stockage autre que celui s&eacute;lectionn&eacute; dans les pr&eacute;f&eacute;rences «&nbsp;Disque de d&eacute;marrage&nbsp;».</p><p>Les modifications apport&eacute;es au mot de passe du programme interne sont appliqu&eacute;es au red&eacute;marrage de votre Mac.</p><ol><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaires&nbsp;&gt; Utilitaire S&eacute;curit&eacute; au d&eacute;marrage.</p></li><li><p>Si vous y &ecirc;tes invit&eacute;, saisissez le nom d&rsquo;utilisateur et le mot de passe d&rsquo;un administrateur.</p></li><li><p>Effectuez l&rsquo;une des op&eacute;rations suivantes&nbsp;:</p><ul><li><p><em>Pour activer le mot de passe du programme interne&nbsp;: </em>cliquez sur «&nbsp;Activer le mot de passe du programme interne&nbsp;», saisissez un nouveau mot de passe, saisissez-le &agrave; nouveau pour le confirmer, puis cliquez sur «&nbsp;D&eacute;finir le mot de passe&nbsp;».</p></li><li><p><em>Pour d&eacute;sactiver le mot de passe du programme interne&nbsp;: </em>cliquez sur «&nbsp;D&eacute;sactiver le mot de passe du programme interne&nbsp;», saisissez le mot de passe, puis cliquez sur «&nbsp;D&eacute;sactiver le mot de passe&nbsp;».</p></li><li><p><em>Pour modifier le mot de passe du programme interne&nbsp;: </em>cliquez sur «&nbsp;Modifier le mot de passe&nbsp;», saisissez l&rsquo;ancien mot de passe, saisissez un nouveau mot de passe et confirmez-le, puis cliquez sur «&nbsp;Modifier le mot de passe&nbsp;».</p></li></ul></li><li><p>Cliquez sur «&nbsp;Quitter Utilitaire S&eacute;curit&eacute; au d&eacute;marrage&nbsp;».</p></li></ol></div></div><div id="mchl4260d54a" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl4260d54a"><div class="heading-nobreak"><h2 aria-controls="aria-mchl4260d54a" class="Name">Utiliser Utilitaire S&eacute;curit&eacute; au d&eacute;marrage pour d&eacute;finir les options de d&eacute;marrage s&eacute;curis&eacute;</h2><p>Les options de d&eacute;marrage s&eacute;curis&eacute; ne sont disponibles que sur les ordinateurs Mac dot&eacute;s de la puce Apple T2 Security.</p></div><p>Les modifications apport&eacute;es aux options de d&eacute;marrage s&eacute;curis&eacute; sont appliqu&eacute;es au red&eacute;marrage de votre Mac.</p><ol><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Utilitaires&nbsp;&gt; Utilitaire S&eacute;curit&eacute; au d&eacute;marrage.</p></li><li><p>Saisissez le nom d&rsquo;utilisateur et le mot de passe d&rsquo;un administrateur.</p></li><li><p>Dans la sous-fen&ecirc;tre «&nbsp;D&eacute;marrage s&eacute;curis&eacute;&nbsp;», choisissez l&rsquo;une des options de s&eacute;curit&eacute; suivantes&nbsp;:</p><ul><li><p><em>S&eacute;curit&eacute; maximale&nbsp;: </em>garantit que seul votre syst&egrave;me d&rsquo;exploitation actuel, ou votre logiciel de syst&egrave;me d&rsquo;exploitation sign&eacute; actuellement approuv&eacute; par Apple, peut s&rsquo;ex&eacute;cuter. Ce mode requiert une connexion r&eacute;seau au moment de l&rsquo;installation des logiciels.</p></li><li><p><em>S&eacute;curit&eacute; moyenne&nbsp;: </em>autorise l&rsquo;ex&eacute;cution de toute version d&rsquo;un logiciel de syst&egrave;me d&rsquo;exploitation sign&eacute; ayant d&eacute;j&agrave; &eacute;t&eacute; approuv&eacute; par Apple.</p></li><li><p><em>Aucune s&eacute;curit&eacute;&nbsp;: </em>n&rsquo;applique aucune mesure de s&eacute;curit&eacute; au syst&egrave;me d&rsquo;exploitation d&eacute;marrable.</p></li></ul></li><li><p>Dans la sous-fen&ecirc;tre «&nbsp;Support de d&eacute;marrage autoris&eacute;&nbsp;», choisissez l&rsquo;une des options de d&eacute;marrage suivantes&nbsp;:</p><ul><li><p><em>Ne pas autoriser le d&eacute;marrage &agrave; partir de supports externes ou amovibles&nbsp;: </em>emp&ecirc;che le d&eacute;marrage depuis tout p&eacute;riph&eacute;rique non prot&eacute;g&eacute; par la puce T2, comme les disques USB et Thunderbolt ou les disques PCIe ou SATA internes.</p></li><li><p><em>Autoriser le d&eacute;marrage &agrave; partir de supports externes ou amovibles&nbsp;: </em>autorise le d&eacute;marrage depuis n&rsquo;importe quel p&eacute;riph&eacute;rique.</p></li></ul></li><li><p>Choisissez Utilitaire S&eacute;curit&eacute; au d&eacute;marrage&nbsp;&gt; Quitter Utilitaire S&eacute;curit&eacute; au d&eacute;marrage.</p></li></ol></div></div><div id="mchlde1a4fd2" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchlde1a4fd2"><div class="heading-nobreak"><h2 aria-controls="aria-mchlde1a4fd2" class="Name">R&eacute;installer macOS</h2><p>Dans certains cas, il peut &ecirc;tre n&eacute;cessaire de r&eacute;installer macOS. Cette r&eacute;installation peut s&rsquo;effectuer en gardant intacts vos fichiers et r&eacute;glages utilisateur.</p></div><ol><li><p>V&eacute;rifiez que vous &ecirc;tes connect&eacute; &agrave; Internet.</p></li><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, cliquez sur «&nbsp;R&eacute;installler macOS Big&nbsp;Sur&nbsp;», puis sur Continuer.</p><div class="Alert"><p class="Important"><strong>Important&nbsp;:</strong> dans la sous-fen&ecirc;tre permettant de s&eacute;lectionner un disque, s&eacute;lectionnez votre disque macOS actuel (dans la plupart des cas, il s&rsquo;agit du seul disque disponible).</p></div></li><li><p>Suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li></ol></div></div><div id="mchlcb3af2f6" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchlcb3af2f6"><div class="heading-nobreak"><h2 aria-controls="aria-mchlcb3af2f6" class="Name">Effacer et r&eacute;installer macOS</h2><p>Si vous effacez puis r&eacute;installez macOS, tous vos comptes utilisateur, r&eacute;glages r&eacute;seau, fichiers et dossiers sont supprim&eacute;s de votre Mac. Avant d&rsquo;effacer macOS, essayez de vous reconnecter &agrave; votre syst&egrave;me, puis sauvegardez tous les fichiers que vous souhaitez conserver en les copiant sur un autre p&eacute;riph&eacute;rique de stockage. Notez &eacute;galement les r&eacute;glages r&eacute;seau d&eacute;finis dans les pr&eacute;f&eacute;rences R&eacute;seau pour vous reconnecter plus facilement apr&egrave;s la r&eacute;installation de macOS.</p></div><ol><li><p>V&eacute;rifiez que vous &ecirc;tes connect&eacute; &agrave; Internet.</p></li><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, cliquez sur «&nbsp;Utilitaire de disque&nbsp;», puis sur Continuer.</p></li><li><p>Dans Utilitaire de disque, s&eacute;lectionnez le volume que vous souhaitez effacer dans la barre lat&eacute;rale, puis cliquez sur le bouton Effacer dans la barre d&rsquo;outils.</p></li><li><p>Saisissez un nom pour le volume dans le champ Nom.</p></li><li><p>Cliquez sur le menu local Format, choisissez APFS, puis cliquez sur «&nbsp;Effacer le groupe de volumes&nbsp;».</p></li><li><p>Une fois le processus d&rsquo;effacement termin&eacute;, cliquez sur Termin&eacute;, puis choisissez Utilitaire de disque&nbsp;&gt; Quitter Utilitaire de disque.</p></li><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, cliquez sur «&nbsp;R&eacute;installler macOS Big&nbsp;Sur&nbsp;», cliquez sur Continuer, puis suivez les instructions &agrave; l&rsquo;&eacute;cran.</p></li></ol></div></div><div id="mchlb6f6d1d9" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchlb6f6d1d9"><div class="heading-nobreak"><h2 aria-controls="aria-mchlb6f6d1d9" class="Name">Consulter l&rsquo;historique de r&eacute;cup&eacute;ration</h2><p>L&rsquo;historique de r&eacute;cup&eacute;ration contient les messages consign&eacute;s par la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS. Vous pouvez choisir les types de messages &agrave; afficher, filtrer les messages pour rechercher un texte pr&eacute;cis, et enregistrer l&rsquo;historique de r&eacute;cup&eacute;ration sous forme de fichier.</p></div><ol><li><p>Dans l&rsquo;app R&eacute;cup&eacute;ration, choisissez Fen&ecirc;tre&nbsp;&gt; Historique de R&eacute;cup&eacute;ration.</p></li><li><p>Cliquez sur le menu local «&nbsp;Niveau de d&eacute;tail&nbsp;», puis choisissez les messages &agrave; afficher&nbsp;:</p><ul><li><p><em>Afficher uniquement les erreurs&nbsp;: </em>choisissez cette option pour n&rsquo;afficher que les messages d&rsquo;erreur.</p></li><li><p><em>Afficher les erreurs et la progression&nbsp;: </em>choisissez cette option pour afficher les messages d&rsquo;erreur et de progression.</p></li><li><p><em>Afficher tout l&rsquo;historique&nbsp;: </em>choisissez cette option pour afficher tous les messages.</p></li></ul></li><li><p>Pour filtrer les messages, saisissez le texte &agrave; rechercher dans le champ Filtre.</p></li><li><p>Pour enregistrer l&rsquo;historique de r&eacute;cup&eacute;ration, cliquez sur le bouton Enregistrer, choisissez un emplacement pour le fichier, puis cliquez sur Enregistrer.</p></li><li><p>Lorsque vous avez termin&eacute; de consulter l&rsquo;historique de r&eacute;cup&eacute;ration, cliquez sur le bouton Fermer&nbsp;<img src="../SharedGlobalArt/IL_XMarkBlackCircleFillRed.png" alt="" height="30" width="30"> dans le coin sup&eacute;rieur gauche de la fen&ecirc;tre.</p></li></ol></div></div><div id="mchl7ed39991" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl7ed39991"><div class="heading-nobreak"><h2 aria-controls="aria-mchl7ed39991" class="Name">Cr&eacute;er un fichier de diagnostic de r&eacute;cup&eacute;ration</h2><p>Si vous signalez un probl&egrave;me &agrave; l&rsquo;aide d&rsquo;Assistant d&rsquo;&eacute;valuation, il peut vous &ecirc;tre demand&eacute; de fournir un fichier de diagnostic de r&eacute;cup&eacute;ration. Vous pouvez cr&eacute;er ce fichier et l&rsquo;enregistrer sur un p&eacute;riph&eacute;rique de stockage externe.</p></div><ol><li><p>Connectez un p&eacute;riph&eacute;rique de stockage externe &agrave; votre Mac.</p></li><li><p>Appuyez sur Contr&ocirc;le&nbsp;+ Option&nbsp;+ Maj&nbsp;+ Commande&nbsp;+ Point.</p></li><li><p>Apr&egrave;s le clignotement de l&rsquo;&eacute;cran, patientez quelques instants jusqu&rsquo;&agrave; ce qu&rsquo;une zone de dialogue apparaisse.</p></li><li><p>Utilisez la zone de dialogue pour enregistrer le fichier de diagnostic de r&eacute;cup&eacute;ration dans un emplacement de votre p&eacute;riph&eacute;rique de stockage externe.</p></li></ol></div></div><div id="mchl6518f21a" class="Task"><div class="TaskBody" role="region" aria-hidden="false" id="aria-mchl6518f21a"><div class="heading-nobreak"><h2 aria-controls="aria-mchl6518f21a" class="Name">Quitter la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS</h2><p>Votre Mac red&eacute;marre automatiquement lors de la restauration de votre syst&egrave;me depuis Time&nbsp;Machine ou lors de la r&eacute;installation de macOS. Dans les autres cas, vous devez quitter manuellement la fonctionnalit&eacute; de r&eacute;cup&eacute;ration de macOS (par exemple, si vous souhaitez sauvegarder vos fichiers avant la r&eacute;installation de macOS ou si vous avez seulement modifi&eacute; un r&eacute;glage &agrave; l&rsquo;aide d&rsquo;Utilitaire S&eacute;curit&eacute; au d&eacute;marrage).</p></div><p>Sur votre Mac, effectuez l&rsquo;une des op&eacute;rations suivantes&nbsp;:</p><ul><li><p><em>Pour red&eacute;marrer votre Mac&nbsp;: </em>choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; Red&eacute;marrer.</p></li><li><p><em>Pour choisir un autre disque de d&eacute;marrage avant de red&eacute;marrer votre Mac&nbsp;: </em>choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; Disque de d&eacute;marrage, s&eacute;lectionnez un disque de d&eacute;marrage, puis cliquez sur Red&eacute;marrer.</p></li><li><p><em>Pour &eacute;teindre votre Mac&nbsp;: </em>choisissez le menu Pomme&nbsp;<img src="../SharedGlobalArt/IL_AppleLogo_11.png" alt="" height="30" width="24">&nbsp;&gt; &Eacute;teindre.</p></li></ul></div></div></header><main></main><footer><p>Copyright&nbsp;© 2021 Apple&nbsp;Inc. Tous droits r&eacute;serv&eacute;s.</p></footer><script type="text/javascript" src="../js/static.js"></script></body></html>